In [20]:
import pandas as pd
people = {
          "First":["keshav","rahul","rajesh","shivam"],
          "Last":['sharma','varma','kushawah','pratap singh'],
          "Email":['keshav4118@gmail.com','rahulsharma81.rs@gmail.com','kesh99072@gmail.com',5]
}

In [21]:
df = pd.DataFrame(people)

In [22]:
df

    First          Last                       Email
0  keshav        sharma        keshav4118@gmail.com
1   rahul         varma  rahulsharma81.rs@gmail.com
2  rajesh      kushawah         kesh99072@gmail.com
3  shivam  pratap singh                           5

In [23]:
df['Email']

0          keshav4118@gmail.com
1    rahulsharma81.rs@gmail.com
2           kesh99072@gmail.com
3                             5
Name: Email, dtype: object

In [24]:
df['First'][3]

'shivam'

In [25]:
type(df['Email'])

pandas.core.series.Series

In [26]:
df.First

0    keshav
1     rahul
2    rajesh
3    shivam
Name: First, dtype: object

In [27]:
df.Last

0          sharma
1           varma
2        kushawah
3    pratap singh
Name: Last, dtype: object

In [28]:
df.columns

Index(['First', 'Last', 'Email'], dtype='object')

In [29]:
df.iloc[0]

First                  keshav
Last                   sharma
Email    keshav4118@gmail.com
Name: 0, dtype: object

In [30]:
df.iloc[[0,-3]]

    First    Last                       Email
0  keshav  sharma        keshav4118@gmail.com
1   rahul   varma  rahulsharma81.rs@gmail.com

In [31]:
df.iloc[[0,1],0]

0    keshav
1     rahul
Name: First, dtype: object

In [32]:
df.loc[[0,1],['Email','Last']]

                        Email    Last
0        keshav4118@gmail.com  sharma
1  rahulsharma81.rs@gmail.com   varma

In [33]:
df.loc[[0,1],['First','Last']]

    First    Last
0  keshav  sharma
1   rahul   varma

In [34]:
df['Last']=='varma'

0    False
1     True
2    False
3    False
Name: Last, dtype: bool

In [44]:
fil = (df["Last"]== "kushawah")
df.loc[fil]

    First      Last                Email
2  rajesh  kushawah  kesh99072@gmail.com

In [51]:
df.loc[fil,'First']

2    rajesh
Name: First, dtype: object

In [52]:
# & ===and
# | === 0r
# ~ === opposite

In [54]:
filt = (df['Last']=='sharma') & (df["First"]=="keshav")
df[filt]

    First    Last                 Email
0  keshav  sharma  keshav4118@gmail.com

In [57]:
filt = (df['Last']=='sharma') | (df["First"]=="rajesh")
df[filt]

    First      Last                 Email
0  keshav    sharma  keshav4118@gmail.com
2  rajesh  kushawah   kesh99072@gmail.com

In [61]:
filt = (df['Last']=='sharma') | (df["First"]=="rajesh")
df[~filt]  
# we got all data except filt condition data becouse we use ~(opposite) symbol

    First          Last                       Email
1   rahul         varma  rahulsharma81.rs@gmail.com
3  shivam  pratap singh                           5